'''
+ 
-
* 对数字是乘法,对字符串和数组是重复
/
//
**
% 对数字是求余, 对字符串格式化
列表和元组相加是拼接,类似于concat,但不支持相减(交并差集使用list里的方法)
数字和字符串相加时,必须统一使用字符串,
没有自增和自减
'''
print("[1] * 3 eq ", [1] * 3)
print("[1,2] + [3,4] eq " , [1,2] + [3,4])
print("(1,2) + (2,3) eq ", (1,2) + (2,3))
print('1 + 3 eq ', 1 + 3)


print('3 / 2 eq ' , 3/2) 
print('3 // 2 eq', 3 // 2)  # 除取整
print( '3 + 2.0 eq', 3 + 2.0)
print('3 * 2 eq ', 3 * 2)
print('3 ** 2 eq ', 3 ** 2)
print('3 % 2 eq ', 3 % 2 )
print('[1,2]*2 eq ',[1,2]*2)
print('GO * 2 eq ', 'GO ' * 2)
a = 3
a += 3 
print('a = 3, a += 3 eq ', a)